# Практическое задание 35.1

## Задания

### Описание задачи
В этом задании ты закрепишь основы работы с функциями. Ты научишься объявлять функцию с помощью `def`, задавать ей параметры, передавать аргументы при вызове и возвращать результат с помощью `return`. Это фундаментальный блок, который закладывает основу для всей дальнейшей работы с функциями. Важно чётко понимать разницу между печатью результата внутри функции и его возвращением.

Ты будешь работать с простыми вычислениями. Создай функцию, которая принимает два числа (ширину и высоту) и возвращает площадь прямоугольника. Затем создай вторую функцию, которая принимает имя пользователя и возвращает приветственную строку, но не печатает её сама.

### Пример входных и выходных данных
**Пример 1: Функция для вычисления площади**
*   **Входные данные (аргументы функции):** `width = 5`, `height = 3`
*   **Что делает функция:** Умножает ширину на высоту.
*   **Возвращаемое значение:** `15`
*   **Как это выглядит в коде:**
    ```python
    # Вызов функции и сохранение результата
    result = calculate_area(5, 3)
    print(result)  # Должно напечатать: 15
    ```

**Пример 2: Функция для создания приветствия**
*   **Входные данные (аргумент функции):** `name = "Владислав"`
*   **Что делает функция:** Формирует строку вида `"Привет, Владислав!"`.
*   **Возвращаемое значение:** `"Привет, Владислав!"`
*   **Как это выглядит в коде:**
    ```python
    # Вызов функции и сохранение результата
    greeting = create_greeting("Владислав")
    print(greeting)  # Должно напечатать: Привет, Владислав!
    ```
*   **Частая ошибка (чего делать НЕ нужно):**
    ```python
    def create_greeting(name):
        print(f"Привет, {name}!")  # Функция ПЕЧАТАЕТ, а не ВОЗВРАЩАЕТ значение.
    
    result = create_greeting("Владислав")
    print(result)  # Напечатает "Привет, Владислав!", а затем "None".
    ```

### Критерии проверки и ограничения
1.  Функции должны быть объявлены с помощью ключевого слова `def`.
2.  У каждой функции должны быть чётко указаны параметры в скобках.
3.  Функции должны использовать оператор `return` для возврата результата.
4.  Не используй `print` внутри функций для вывода основного результата (можно использовать для отладки, но итоговый результат должен возвращаться).
5.  Вызов функций и работа с возвращёнными значениями должны происходить за пределами их объявления (в основном коде).
6.  **Важно:** Используй только пройденные темы: `def`, параметр, аргумент, `return`, `None`, позиционные аргументы. Не используй значения по умолчанию, именованные аргументы, `*args`, `**kwargs` или любые другие темы из будущих блоков.

### Решение задачи (псевдокод)
1.  Объяви функцию с именем `calculate_area`.
    *   Укажи, что она принимает два параметра (например, `width` и `height`).
    *   Внутри функции вычисли результат умножения первого параметра на второй.
    *   Верни этот результат с помощью соответствующей команды.
2.  Объяви функцию с именем `create_greeting`.
    *   Укажи, что она принимает один параметр (например, `name`).
    *   Внутри функции создай строку, соединив текст `"Привет, "`, значение параметра и знак `"!"`.
    *   Верни эту строку с помощью соответствующей команды.
3.  В основном коде (после объявления функций):
    *   Вызови функцию `calculate_area`, передав ей два числа в качестве аргументов. Сохрани то, что она вернёт, в переменную.
    *   Напечатай значение этой переменной.
    *   Вызови функцию `create_greeting`, передав ей строку с именем. Сохрани то, что она вернёт, в другую переменную.
    *   Напечатай значение этой переменной.

### Рекомендации
*   **Вынести в отдельную функцию:** В этом задании вся логика уже разбита на две отдельные функции (`calculate_area` и `create_greeting`). Дополнительного вынесения не требуется.
*   **PEP8:**
    *   Используй осмысленные имена для функций и параметров, которые отражают их назначение (например, `calculate_area`, `width`, `name`).
    *   После объявления функции оставляй две пустые строки перед следующим блоком кода (например, перед следующим объявлением функции или основным кодом).
